X_array = [852.5;852.5;677.5;677.5;502.5;502.5;-502.5;-502.5;-677.5;-677.5;-852.5;-852.5]; % Вектор x-кооридниат центров оснований баков, мм
Y_array = [-325;325;-191.7;191.7;-325;325;-325;325;-191.7;191.7;-325;325]; % Вектор y-кооридниат центров оснований баков, мм
Z_array = [252.7;252.7;252.7;252.7;252.7;252.7;252.7;252.7;252.7;252.7;252.7;252.7]; % Вектор z-кооридниат центров оснований баков, мм
M = [X_array, Y_array, Z_array];
A = [5 6 7 8 15 20 0];
B = [-1 -2 -3 -4 -6 -10];
C = [0 20 -40 -23 -1 1];

[min, max] = bounds(M(:,2));
if abs(min) > max
    max_abs = min;
else
    max_abs = max;
end
